In [1]:
import pandas as pd

In [2]:
url = 'https://en.wikipedia.org/wiki/List_of_largest_companies_by_revenue'

In [3]:
tables = pd.read_html(url)

In [4]:
type(tables)

list

In [5]:
len(tables)

6

In [6]:
req_table = tables[0]
req_table.head()

,Rank,Name,Industry,Revenue,Profit,Employees,Headquarters[note 1],State-owned,Ref.,Revenue per worker
,Rank,Name,Industry,USD millions,USD millions,Employees,Headquarters[note 1],State-owned,Ref.,Revenue per worker
0,1,Walmart,Retail,"$611,289","$11,680",2100000,United States,NaN,[1],"$291,090.00"
1,2,Saudi Aramco,Oil and gas,"$603,651","$159,069",70496,Saudi Arabia,NaN,[4],"$8,562,911.37"
2,3,Amazon,Retail,"$574,785","$30,425",1525000,United States,NaN,[5],"$376,908"
3,4,State Grid Corporation of China,Electricity,"$530,009","$8,192",870287,China,NaN,[6],"$609,004.85"
4,5,Vitol,Commodities,"$505,000","$15,000",1560,Switzerland,NaN,[7][8],"$323,717,948.72"

In [7]:
req_table.columns

MultiIndex([(                'Rank',                 'Rank'),
            (                'Name',                 'Name'),
            (            'Industry',             'Industry'),
            (             'Revenue',         'USD millions'),
            (              'Profit',         'USD millions'),
            (           'Employees',            'Employees'),
            ('Headquarters[note 1]', 'Headquarters[note 1]'),
            (         'State-owned',          'State-owned'),
            (                'Ref.',                 'Ref.'),
            (  'Revenue per worker',   'Revenue per worker')],
           )

In [8]:
req_table.columns = req_table.columns.droplevel(1)

In [9]:
req_table.head()

,Rank,Name,Industry,Revenue,Profit,Employees,Headquarters[note 1],State-owned,Ref.,Revenue per worker
0,1,Walmart,Retail,"$611,289","$11,680",2100000,United States,NaN,[1],"$291,090.00"
1,2,Saudi Aramco,Oil and gas,"$603,651","$159,069",70496,Saudi Arabia,NaN,[4],"$8,562,911.37"
2,3,Amazon,Retail,"$574,785","$30,425",1525000,United States,NaN,[5],"$376,908"
3,4,State Grid Corporation of China,Electricity,"$530,009","$8,192",870287,China,NaN,[6],"$609,004.85"
4,5,Vitol,Commodities,"$505,000","$15,000",1560,Switzerland,NaN,[7][8],"$323,717,948.72"

In [10]:
req_table.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 10 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Rank                  50 non-null     int64
 1   Name                  50 non-null     object
 2   Industry              50 non-null     object
 3   Revenue               50 non-null     object
 4   Profit                50 non-null     object
 5   Employees             50 non-null     int64
 6   Headquarters[note 1]  50 non-null     object
 7   State-owned           0 non-null      float64
 8   Ref.                  50 non-null     object
 9   Revenue per worker    50 non-null     object
dtypes: float64(1), int64(2), object(7)
memory usage: 4.0+ KB

In [11]:
req_table.isnull().sum()

Rank                     0
Name                     0
Industry                 0
Revenue                  0
Profit                   0
Employees                0
Headquarters[note 1]     0
State-owned             50
Ref.                     0
Revenue per worker       0
dtype: int64

In [12]:
req_table.shape

(50, 10)